app/controllers/classrooms_controller.rb

  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save
---
INSERT INTO "classrooms" ("name", "teacher", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1"], ["teacher", "Ms. Frizzle"], ["created_at", "2015-06-05 01:54:26.125345"], ["updated_at", "2015-06-05 01:54:26.125345"]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]