app/controllers/conversations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
  def create
    recipients = User.where(id: conversation_params[:recipients])