app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "gender", "image", "classroom", "parent1", "parent2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "image" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["image", "http://projectfandom.com/wp-content/uploads/2013/06/doctor-who-river-song-300x337.jpg"], ["updated_at", "2015-06-05 01:49:48.658119"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)